In [1]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

# 1. Attendance Data

Load the attendance.csv file and calculate an attendance percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

You should end up with something like this:

name
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: grade, dtype: float64

In [2]:
attendance_df = pd.read_csv('attendance.csv')

In [3]:
attendance_df

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [4]:
attendance_df = attendance_df.rename(columns=
                                     {'Unnamed: 0': 'student',
                                      '2018-01-01':'Jan_01',
                                      '2018-01-02': 'Jan_02',
                                      '2018-01-03':'Jan_03',
                                      '2018-01-04': 'Jan_04',
                                      '2018-01-05':'Jan_05',
                                      '2018-01-06': 'Jan_06',
                                      '2018-01-07':'Jan_07',
                                      '2018-01-08': 'Jan_08'})

attendance_df

  student Jan_01 Jan_02 Jan_03 Jan_04 Jan_05 Jan_06 Jan_07 Jan_08
0   Sally      P      T      T      H      P      A      T      T
1    Jane      A      P      T      T      T      T      A      T
2   Billy      A      T      A      A      H      T      P      T
3    John      P      T      H      P      P      T      P      P

In [5]:
attendance_df = attendance_df.replace('P',1)
attendance_df = attendance_df.replace('H',.5)
attendance_df = attendance_df.replace('T',.9)
attendance_df = attendance_df.replace('A',0)

attendance_df.head()

  student  Jan_01  Jan_02  Jan_03  Jan_04  Jan_05  Jan_06  Jan_07  Jan_08
0   Sally       1     0.9     0.9     0.5     1.0     0.0     0.9     0.9
1    Jane       0     1.0     0.9     0.9     0.9     0.9     0.0     0.9
2   Billy       0     0.9     0.0     0.0     0.5     0.9     1.0     0.9
3    John       1     0.9     0.5     1.0     1.0     0.9     1.0     1.0

In [10]:
total = attendance_df.sum(axis=1)
days = attendance_df.count(axis=1)

0    9
1    9
2    9
3    9
dtype: int64

In [13]:
attendance_df['percentage'] = round((total/days)*100,2)

In [14]:
attendance_df

,student,Jan_01,Jan_02,Jan_03,Jan_04,Jan_05,Jan_06,Jan_07,Jan_08,percentage
0,Sally,1,0.9,0.9,0.5,1.0,0.0,0.9,0.9,67.78
1,Jane,0,1.0,0.9,0.9,0.9,0.9,0.0,0.9,61.11
2,Billy,0,0.9,0.0,0.0,0.5,0.9,1.0,0.9,46.67
3,John,1,0.9,0.5,1.0,1.0,0.9,1.0,1.0,81.11

In [15]:
attendance_df = attendance_df.replace(1,'P')
attendance_df = attendance_df.replace(.5,'H')
attendance_df = attendance_df.replace(.9,'T')
attendance_df = attendance_df.replace(0,'A')

attendance_df.head()

  student Jan_01 Jan_02 Jan_03 Jan_04 Jan_05 Jan_06 Jan_07 Jan_08  percentage
0   Sally      P      T      T      H      P      A      T      T       67.78
1    Jane      A      P      T      T      T      T      A      T       61.11
2   Billy      A      T      A      A      H      T      P      T       46.67
3    John      P      T      H      P      P      T      P      P       81.11

# 2. Coffee Levels

a. Read the coffee_levels.csv file.

b. Transform the data so that each carafe is in it's own column.

c. Is this the best shape for the data?

# 3. Cake Recipes

a. Read the cake_recipes.csv data. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.

b. Tidy the data as necessary.

c. Which recipe, on average, is the best? recipe b

d. Which oven temperature, on average, produces the best results? 275

e. Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees